Repository: MarthamEngineering/Piscan
Catalog: Piscan/i18n/*.po
Languages: de_de

source: Caught exception:
de_de: Ausnahme Fehler:

source: Caught runtime_error:
de_de: Laufzeit Fehler:

source: Scan3D analyzes a set of jpg frames created with a 3D scanner setup and outputs the extracted 3D data in AC3D file format.
de_de: Scan3D analysiert - von einem 3D Scanner generierte - Einzelbilder im jpeg Format und gibt die extrahierten 3D Daten im AC3D Format aus.

source: See: http://www.sjbaker.org/wiki/index.php?title=A_Simple_3D_Scanner
de_de: Siehe: http://www.sjbaker.org/wiki/index.php?title=A_Simple_3D_Scanner

source: USAGE: Scan3D.exe [-h] [[-i='input directory'] [-o='output file'] [OPTION=value]*]
de_de: Anwendung: Scan3D.exe [-h] [[-i='Eingabeverzeichniss'] [-o='Ausgabedatei'] [OPTION=Wert]*]

source: ' to a number!
de_de: ' in eine Zahl!

source: -h: this output.
de_de: -h: dieser Hilfetext.

source: -i 'input directory': directory where the jpg frames are located (default: current directory).
de_de: -i 'Eingabeverzeichniss': Verzeichniss wo Einzelbilder im jpg Format sind (standard: aktuelles Verzeichniss).

source: -o 'output file': file where 3D data will be written in AC3D format (default: standard output).
de_de: -o 'Ausgabe Datei': Datei wohin 3D Daten im AC3D Format geschrieben werden (standard: Standardausgabe).

source: Error converting '
de_de: Fehler bei Umwandlung von '

source: Error opening '
de_de: Fehler beim öffnen von '

source: Error: cannot find jpg frames in directory '
de_de: Fehler: keine JPG Einzelbilder im Verzeichniss '

source: Error: invalid angle for LASER_OFFSET !
de_de: Fehler: ungültiger Winkel für LASER_OFFSET !

source: Error: value for frames to skip (=FRAME_SKIP) cannot be 0 !
de_de: Fehler: Wert für zu überspringende Einzelbilder (=FRAME_SKIP) darf nicht 0 sein!

source: Error: value for lines to skip (=LINE_SKIP) cannot be 0 !
de_de: Fehler: Wert für zu überspringende Zeilen (=LINE_SKIP) darf nicht 0 sein!

source: Error: value vor horizontal average (=HORIZ_AVG) cannot be 0 !
de_de: Fehler: Wert für den horizontalen Durchschnitt (=HORIZ_AVG) darf nicht 0 sein!

source: Error: value vor verical average (=VERT_AVG) cannot be 0 !
de_de: Fehler: Wert für den verticalen Durchschnitt (=VERT_AVG) darf nicht 0 sein!

source: OPTIONS:
de_de: OPTIONEN:

source: Processing frame
de_de: Bearbeitung von Einzelbild

source: The program expects the input frames in jpg format. The single pictures must be numbered from 00000000.jpg upwards. All angles are in degrees, all distances are in meters and parameters are case sensitive. CAMERA_DISTANCE: The distance from camera to center of turntable in meter (required/cannot be <=0). LASER_OFFSET: The angle between the centerline of the camera and the laser - should be about 15 degrees (required). CAMERA_HFOV: This is the camera lens angle (default: 50.0 degrees). CAMERA_VFOV: Leave this alone, unless you are working with an unusual kind of camera such as an HDTV camera which doesn't have the usual aspect ratios (default: CAMERA_HFOV*4.0/5.0 degrees). Additionally, you might want to change: HORIZ_AVG: The number of consecutive horizontal points to average together to smooth out the surface (default: 10/cannot be 0). VERT_AVG: The number of consecutive vertical points to average together to smooth out the surface (default: 10/cannot be 0). Increasing these numbers gets rid of odd spikes and other small errors - but reduces the number of polygons making up the final model and thereby reduces the precision of the final model. FRAME_SKIP: Use only every n'th frame for speed (default: 1/cannot be 0). LINE_SKIP: Use only every n'th scanline for speed (default: 1/cannot be 0).
de_de: Dieses Programm verarbeitet Einzelbilder im jpeg Format. Diese Einzelbilder müssen von 00000000.jpg aufwärts nummeriert/benannt sein. Alle Winkel sind in Grad, alle Entfernungen in Meter und die einzelnen Optionen berücksichtigen Gross. -und Kleinschreibung. CAMERA_DISTANCE: Die Entfernung von der Kamera zum Mittelpunkt des Drehtellers in Meter (zwingend nötig/darf nicht <=0 sein). LASER_OFFSET: Der Winkel zwischen Zentrumslinien von Kamera und Laser - sollte ungefähr 15 Grad sein (zwingend nötig). CAMERA_HFOV: Das ist die Brennweite der Kamera (standard: 50.0 Grad). CAMERA_VFOV: Sollte nicht geändert werden solange man nicht mit ungewöhnlichen Kameras wie z.B.: HDTV Kameras arbeitet welche kein Standardbildformat aufweisen (standard: CAMERA_HFOV*4.0/5.0 Grad). Zusätzlich können noch folgende Optionen angepasst werden: HORIZ_AVG: Die Zahl von aufeinanderfolgenden horizontalen Punkten welche zusammengefasst werden, um die Oberfläche glatter zu machen (standard: 10/darf nicht 0 sein). VERT_AVG: Die Zahl von aufeinanderfolgenden vertikalen Punkten welche zusammengefasst werden, um die Oberfläche glatter zu machen (standard: 10/darf nicht 0 sein). Werden diese Zahlen vergrössert, werden Unregelmässigkeiten in der Oberfläche unterdrückt, aber es wird dadurch auch die Zahl der Dreiecke im Modell verkleinert und damit die Genauigkeit des Modells. FRAME_SKIP: Verwendet nur jedes n'te Einzelbild zur Erhöhung der Verarbeitungsgeschwindigkeit (standard: 1/darf nicht 0 sein). LINE_SKIP: Verwendet nur jede n'te Bildzeile zur Erhöhung der Verarbeitungsgeschwindigkeit (standard: 1/darf nicht 0 sein).

source: Unknown configuration parameter '
de_de: Unbekannter Konfigurationsparameter '

source: readJPEG: %s has %d components?!?
de_de: readJPEG: %s hat %d Komponenten?!?

source: readJPEG: Can't open %s for reading
de_de: readJPEG: Kann %s nicht zum Lesen öffnen
